Процедура ОбработкаПроведения(Отказ, Режим)
	// 1. Проверка на остаток на дату документа
	омКонтрольОстатковСервер.ПроверитьНаличие(СписокТоваров.Выгрузить(), Дата, Отказ);	
	Если Отказ Тогда Возврат ; КонецЕсли;
	
	// 2. Проверка на остаток всего по итогам регистра
	омКонтрольОстатковСервер.ПроверитьНаличие(СписокТоваров.Выгрузить(), Дата('00010101000000'), Отказ);
	Если Отказ Тогда Возврат ; КонецЕсли;

	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТоваров Из СписокТоваров Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();		
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаСписокТоваров);
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЦикла;
	Движения.Записать();
	
КонецПроцедуры



//Процедура ОбработкаПроведения(Отказ, Режим)
//	// регистр ОстаткиТоваров Расход
//	Движения.ОстаткиТоваров.Записывать = Истина;
//	Для Каждого ТекСтрокаСписокТоваров Из СписокТоваров Цикл
//		Движение = Движения.ОстаткиТоваров.Добавить();
//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
//		Движение.Период = Дата;
//		Движение.Товар = ТекСтрокаСписокТоваров.Товар;
//		Движение.СрокГодности = ТекСтрокаСписокТоваров.СрокГодности;
//		Движение.Количество = ТекСтрокаСписокТоваров.Количество;
//	КонецЦикла;

//	Движения.Записать();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ОстаткиТоваровОстатки.СрокГодности КАК СрокГодности,
//		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
//		|	ОстаткиТоваровОстатки.Товар.Наименование КАК ТоварНаименование
//		|ИЗ
//		|	РегистрНакопления.ОстаткиТоваров.Остатки(&Дата) КАК ОстаткиТоваровОстатки
//		|ГДЕ
//		|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
//	Запрос.УстановитьПараметр("Дата", Новый Граница(МоментВремени(), ВидГраницы.Включая));
//	РезультатЗапроса = Запрос.Выполнить();
//	Если НЕ РезультатЗапроса.Пустой() Тогда
//		Отказ = Истина;
//		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
//			Сообщить("Мало товара " + ВыборкаДетальныеЗаписи.ТоварНаименование + ", надо ещё " + (-ВыборкаДетальныеЗаписи.КоличествоОстаток));				
//		КонецЦикла;		
//	КонецЕсли;	
//		
//КонецПроцедуры
