&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)
	// 1. Проверка на остаток на дату документа
	омКонтрольОстатковСервер.ПроверитьНаличие(СписокТоваров.Выгрузить(), Дата, Отказ);	
	Если Отказ Тогда Возврат ; КонецЕсли;
	
	// 2. Проверка на остаток всего по итогам регистра
	омКонтрольОстатковСервер.ПроверитьНаличие(СписокТоваров.Выгрузить(), Дата('00010101000000'), Отказ);
	Если Отказ Тогда Возврат ; КонецЕсли;
	
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТоваров Из СписокТоваров Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();		
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаСписокТоваров);
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЦикла;
	Движения.Записать();	
КонецПроцедуры


