&НаСервере
// Режим 1 - возврат запроса с учетом списка  товаров
// Режим 2 - возврат запроса по всем резервам контрагента
Функция ПолучитьТекстЗапросаПоРезервам(Режим = 1)
	Перем текстЗапроса;
	
	Если Режим = 1 Тогда
		текстЗапроса = "ВЫБРАТЬ
		               |	РезервыТоваровОстатки.Товар,
		               |	РезервыТоваровОстатки.ПартияРезерва,
		               |	РезервыТоваровОстатки.Контрагент,
		               |	СУММА(РезервыТоваровОстатки.КоличествоОстаток) КАК Количество
		               |ИЗ
		               |	РегистрНакопления.РезервыТоваров.Остатки(
		               |			,
		               |			Контрагент = &Контрагент
		               |				И ПартияРезерва = &ПартияРезерва) КАК РезервыТоваровОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РезервыТоваровОстатки.Товар,
		               |	РезервыТоваровОстатки.ПартияРезерва,
		               |	РезервыТоваровОстатки.Контрагент";
	Иначе
		текстЗапроса = "ВЫБРАТЬ
		               |	РезервыТоваровОстатки.Товар,
		               |	РезервыТоваровОстатки.ПартияРезерва,
		               |	РезервыТоваровОстатки.Контрагент,
		               |	СУММА(РезервыТоваровОстатки.КоличествоОстаток) КАК Количество
		               |ИЗ
		               |	РегистрНакопления.РезервыТоваров.Остатки(
		               |			,
					   |			Контрагент = &Контрагент
					   //|				И ПартияРезерва = &ПартияРезерва
					   | ) КАК РезервыТоваровОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РезервыТоваровОстатки.Товар,
		               |	РезервыТоваровОстатки.ПартияРезерва,
		               |	РезервыТоваровОстатки.Контрагент";		
	КонецЕсли;
	
	Возврат(текстЗапроса);
КонецФункции

&НаСервере
Процедура ПолучитьРезервыПоДокументуОснованию(Контрагент, ДокументОснование = Неопределено, сзСписокТоваров = Неопределено, Отказ=ЛОЖЬ)	Экспорт
	РежимЗапроса = 1;
	Если ДокументОснование = Неопределено 
		ИЛИ ДокументОснование = NULL 
			ИЛИ ДокументОснование = Документы.РезервированиеТоваров.ПустаяСсылка() 
	Тогда
		РежимЗапроса  = 2 ;
	КонецЕсли;
	
	ТекстЗапроса = ПолучитьТекстЗапросаПоРезервам(РежимЗапроса);
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ПартияРезерва",ДокументОснование);
	// Проверка на тип параметра сзСписокТоваров
	Если 
		сзСписокТоваров = Неопределено
		ИЛИ сзСписокТоваров = NULL
			ИЛИ (НЕ (Тип("СписокЗначений") = ТипЗнч(сзСписокТоваров)))
	Тогда    
		Возврат;
	КонецЕсли;
	
	РЗапроса = Запрос.Выполнить();	
	ВЗапроса = РЗапроса.Выбрать();
	Пока ВЗапроса.Следующий() Цикл
		СтруктураРезерва = Новый Структура("ПартияРезерва, Контрагент, Товар, Количество");
		ЗаполнитьЗначенияСвойств(СтруктураРезерва, ВЗапроса);
		сзСписокТоваров.Добавить(СтруктураРезерва);
	КонецЦикла;
	
КонецПроцедуры

