
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗначенияРеквизитовТоваров
	Движения.ЗначенияРеквизитовТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаХарактеристикиТовара Из ХарактеристикиТовара Цикл
		Движение = Движения.ЗначенияРеквизитовТоваров.Добавить();
		Движение.Товар = ТекСтрокаХарактеристикиТовара.Товар;
		Движение.Характеристика = ТекСтрокаХарактеристикиТовара.Характеристика;
		Движение.ЗначениеХарактеристики = ТекСтрокаХарактеристикиТовара.Значение;
		Движение.ДокументУстановкиРеквизитов = Ссылка;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
