
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	// регистр ТоварыВСистеме Расход
	Движения.ТоварыВСистеме.Записывать = Истина;
	Для Каждого ТекСтрокаТехникаВРаботе Из ТехникаВРаботе Цикл
		Движение = Движения.ТоварыВСистеме.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТехникаВРаботе.Товар;
		Движение.Партия = Ссылка;
		Движение.РабочееМесто = Справочники.РабочиеМеста.ГлавныйСклад;
		Движение.Количество = ТекСтрокаТехникаВРаботе.Количество;
	КонецЦикла;

	// регистр ТоварыВСистеме Приход
	Движения.ТоварыВСистеме.Записывать = Истина;
	Для Каждого ТекСтрокаТехникаВРаботе Из ТехникаВРаботе Цикл
		Движение = Движения.ТоварыВСистеме.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТехникаВРаботе.Товар;
		Движение.Партия = Ссылка;
		Движение.РабочееМесто = ТекСтрокаТехникаВРаботе.РабочееМесто;
		Движение.Количество = ТекСтрокаТехникаВРаботе.Количество;
	КонецЦикла;
	
	Движения.СтатусТовара.Записывать = Истина;
	Для Каждого ТекСтрокаТехникаВРаботе Из ТехникаВРаботе Цикл
		ДвижениеР = Движения.СтатусТовара.Добавить();
		ДвижениеР.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеР.Период = Дата;
		ДвижениеР.Товар = ТекСтрокаТехникаВРаботе.Товар;
		ДвижениеР.Документ = Ссылка;
		ДвижениеР.Статус = Перечисления.СтатусыТовара.Новый;
		ДвижениеР.Количество = ТекСтрокаТехникаВРаботе.Количество;
		
		ДвижениеП = Движения.СтатусТовара.Добавить();
		ДвижениеП.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеП.Период = Дата;
		ДвижениеП.Товар = ТекСтрокаТехникаВРаботе.Товар;
		ДвижениеП.Документ = Ссылка;
		ДвижениеП.Статус = Перечисления.СтатусыТовара.ВРаботе;
		ДвижениеП.Количество = ТекСтрокаТехникаВРаботе.Количество;		
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
