
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
	сзРезервыКСписанию = Новый СписокЗначений();
	омРезервыСервер.ПолучитьРезервыПоДокументуОснованию(Контрагент,ДокументРезерва,сзРезервыКСписанию,Отказ);
	ПроведениеПоРегиструРезервы(сзРезервыКСписанию);	
КонецПроцедуры

Процедура ПроведениеПоРегиструРезервы(сзРезервыКСписанию)
	
	Движения.РезервыТоваров.Записывать = ИСТИНА;	
	Для Каждого СтрРезерва ИЗ сзРезервыКСписанию Цикл
		Движ = Движения.РезервыТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(Движ, СтрРезерва.Значение);		
		Движ.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движ.Период = Дата;
	КонецЦикла;
	
КонецПроцедуры