
&НаСервере
Функция ВернутьТекстЗапросаПоТоварам()
	Возврат "ВЫБРАТЬ
	        |	ОстаткиТоваровОстатки.Товар КАК Товар,
	        |	ОстаткиТоваровОстатки.СрокГодности КАК СрокГодности,
	        |	СУММА(ОстаткиТоваровОстатки.КоличествоОстаток) КАК Количество
	        |ИЗ
	        |	РегистрНакопления.ОстаткиТоваров.Остатки(&ДатаСреза, СрокГодности <= &ДатаСреза) КАК ОстаткиТоваровОстатки
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ОстаткиТоваровОстатки.Товар,
	        |	ОстаткиТоваровОстатки.СрокГодности";
КонецФункции

&НаСервере
Процедура ЗаполнитьИстекшимиНаСервере()
	// Вставить содержимое обработчика.	
	СписокТоваров = ЭтотОбъект.Объект.СписокТоваров;	
	СписокТоваров.Очистить();
	ТекстЗапроса = ВернутьТекстЗапросаПоТоварам();
	Запрос = Новый Запрос(ТекстЗапроса);
	ДатаСреза = ЭтотОбъект.Объект.Дата;
	//СрокГодности = ДатаСреза - 
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	//Запрос.УстановитьПараметр("СрокГодности", СрокГодности);
	РЗапроса = Запрос.Выполнить(); 
	ВЗапроса = РЗапроса.Выбрать();	
	
	Пока ВЗапроса.Следующий() Цикл
		СтрокаСписания = СписокТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСписания, ВЗапроса);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИстекшими(Команда)	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьИстекшимиЗавершение", ЭтотОбъект), "Перед заполнением табличная часть документа будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, "Заполнение табчасти", КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИстекшимиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИстекшимиНаСервере();
	
КонецПроцедуры

