

Процедура ОбработкаПроведения(Отказ, Режим)
	Перем сзОтсутствующиеТовары;
	сзОтсутствующиеТовары = Новый СписокЗначений();
	РежимКонтроля = 2;
	омКонтрольОстатковСервер.КонтрольОстатковНаСервере(СписокТоваров.Выгрузить(),Контрагент, Отказ, Дата, сзОтсутствующиеТовары, РежимКонтроля);
	
	
	Если Отказ Тогда 
		// Обработать список из предыдущей процедуры
		Для Каждого ССписка Из сзОтсутствующиеТовары Цикл
			Сообщить(" Не хватает товара: " + ССписка.Значение.Товар.Наименование +". Количество остаток " + Строка(ССписка.Значение.Остаток), СтатусСообщения.Внимание );
		КонецЦикла;
		Возврат; 
	КонецЕсли;
	
	// регистр РезервыТоваров Приход
	Движения.РезервыТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТоваров Из СписокТоваров Цикл
		Движение = Движения.РезервыТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ПартияРезерва = ЭтотОбъект.Ссылка;
		Движение.Контрагент = Контрагент;
		Движение.Товар = ТекСтрокаСписокТоваров.Товар;
		Движение.Количество = ТекСтрокаСписокТоваров.Количество;
	КонецЦикла;
	
КонецПроцедуры
