
&НаСервере
Процедура СписокТоваровТоварПриИзмененииНаСервере(ДанныеВыбора, ИДСтроки = 0)
	// Вставить содержимое обработчика.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОстаткиТоваровОстатки.СрокГодности КАК СрокГодности,
	                      |	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
	                      |ИЗ
	                      |	РегистрНакопления.ОстаткиТоваров.Остатки(&Дата, Товар = &Товар) КАК ОстаткиТоваровОстатки
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	СрокГодности");
	
	Если (ИДСтроки = Неопределено ИЛИ ИДСтроки = NULL) Тогда
		Возврат;
	КонецЕсли;
	
	Товар = ?(Объект.СписокТоваров.Количество() > ИДСтроки И ИДСтроки >=0 , Объект.СписокТоваров[ИДСтроки].Товар.Ссылка,Справочники.Товары.ПустаяСсылка());
	Если Товар = Справочники.Товары.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Объект.Дата);
	Запрос.УстановитьПараметр("Товар", 	Товар );
	РЗапроса = Запрос.Выполнить(); ВЗапроса = РЗапроса.Выбрать();
	ДанныеВыбора.Очистить(); 
	Пока ВЗапроса.Следующий() Цикл
		ДанныеВыбора.Добавить(ВЗапроса.СрокГодности);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
	ДанныеВыбора = ЭтотОбъект.ЭтаФорма.Элементы.СписокТоваровСрокГодности.СписокВыбора;
	ИДСтроки = ЭтотОбъект.ЭтаФорма.Элементы.СписокТоваров.ТекущаяСтрока;

	СписокТоваровТоварПриИзмененииНаСервере(ДанныеВыбора, ИДСтроки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.СписокТоваровСрокГодности.СписокВыбора.ЗагрузитьЗначения(ДанныеВыбора.ВыгрузитьЗначения());
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровТоварОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ТДанныеВыбора = ЭтотОбъект.ЭтаФорма.Элементы.СписокТоваровСрокГодности.СписокВыбора;
	ИДСтроки = ЭтотОбъект.ЭтаФорма.Элементы.СписокТоваров.ТекущаяСтрока;
	СписокТоваровТоварПриИзмененииНаСервере(ТДанныеВыбора, ИДСтроки);
	ЭтотОбъект.ЭтаФорма.Элементы.СписокТоваровСрокГодности.СписокВыбора.ЗагрузитьЗначения(ДанныеВыбора.ВыгрузитьЗначения());	
КонецПроцедуры
