&НаСервере
Процедура ПроверитьНаличие(тзСписокТоваров,  Дата, Отказ = ЛОЖЬ) Экспорт
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Т.Товар КАК Товар,
		|	Т.СрокГодности КАК СрокГодности,
		|	Т.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_тзТовары
		|ИЗ
		|	&тзСписокТоваров КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.СрокГодности КАК СрокГодности,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК Количество,
		|	ОстаткиТоваровОстатки.Товар КАК Товар
		|ПОМЕСТИТЬ ВТ_ТОВАРЫ_ОСТАТКИ
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			&Дата,
		|			Товар В
		|					(ВЫБРАТЬ
		|						ВТ_тзТовары.Товар
		|					ИЗ
		|						ВТ_тзТовары)
		|				И СрокГодности В
		|					(ВЫБРАТЬ
		|						ВТ_тзТовары.СрокГодности
		|					ИЗ
		|						ВТ_тзТовары)) КАК ОстаткиТоваровОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_тзТовары.Товар КАК Товар,
		|	ЕСТЬNULL(ВТ_ТОВАРЫ_ОСТАТКИ.СрокГодности, 0) КАК СрокГодности,
		|	ЕСТЬNULL(ВТ_ТОВАРЫ_ОСТАТКИ.Количество, 0) КАК Количество,
		|	ЕСТЬNULL(ВТ_тзТовары.Количество, 0) КАК КоличествоКСписанию
		|ИЗ
		|	ВТ_тзТовары КАК ВТ_тзТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТОВАРЫ_ОСТАТКИ КАК ВТ_ТОВАРЫ_ОСТАТКИ
		|		ПО ВТ_тзТовары.Товар = ВТ_ТОВАРЫ_ОСТАТКИ.Товар
		|			И ВТ_тзТовары.СрокГодности = ВТ_ТОВАРЫ_ОСТАТКИ.СрокГодности";
	
	Если Дата = Дата('00010101000000') Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Дата,", ",");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата", Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("тзСписокТоваров", тзСписокТоваров);
	РЗапроса = Запрос.Выполнить();
	ВЗапроса = РЗапроса.Выбрать();
	Пока ВЗапроса.Следующий() Цикл
		Если ВЗапроса.Количество = 0 ИЛИ ((ВЗапроса.Количество - ВЗапроса.КоличествоКСписанию) < 0 ) Тогда
					Отказ = ИСТИНА;					
					Сообщить("Не хватает товара для списания: "
							+ Символы.ПС + Строка(ВЗапроса.Товар.Наименование) + " "
							+ Символы.ПС + "Остаток: " + Строка(ВЗапроса.Количество) + " "
							+ Символы.ПС + "Нужно: "  + Строка(ВЗапроса.КоличествоКСписанию) + " "
							);
					Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

